let posts = [
  {
    link: "../assets/pro.png",
    name: "Shalom 0",
    date: "18:33 23/1/2012",
    msg: `איזה תוכנית מעולהההההההההאיזה תוכנית מעולהההההההההאיזה תוכנית
מעולהההההההההאיזה תוכנית מעולההההההההה איזה תוכנית מעולההההההההה איזה
תוכנית מעולההההההההה איזה תוכנית מעולהההההההההאיזה תוכנית
מעולההההההההה`
  },
  {
    link: "../assets/pro.png",
    name: "Shalom 1",
    date: "18:33 23/1/2012",
    msg: `איזה תוכנית מעולהההההההההאיזה תוכנית מעולהההההההההאיזה תוכנית
מעולהההההההההאיזה`
  },
  {
    link: "../assets/pro.png",
    name: "Shalom 2",
    date: "18:33 23/1/2012",
    msg: `איזה תוכנית מעולהההההההההאיזה תוכנית מעולהההההההההאיזה תוכנית
מעולהההההההההאיזה תוכנית מעולההההההההה איזה תוכנית מעולההההההההה איזה
תוכנית מעולההההההההה איזה תוכנית מעולהההההההההאיזה תוכנית
מעולההההההההה`
  },
  {
    link: "../assets/pro.png",
    name: "Shalom 3",
    date: "18:33 23/1/2012",
    msg: `איזה תוכנית מעולהההההההההאיזה תוכנית מעולהההההההההאיזה תוכנית
מעולהההההההההאיזה תוכנית מעולההההההההה איזה תוכנית מעולההההההההה איזה
תוכנית מעולההההההההה איזה תוכנית מעולהההההההההאיזה תוכנית
מעולההההההההה`
  },
  {
    link: "../assets/pro.png",
    name: "Shalom 4",
    date: "18:33 23/1/2012",
    msg: `איזה תוכנית מעולהההההההההאיזה תוכנית מעולהההההההההאיזה תוכנית
מעולהההההההההאיזה תוכנית מעולההההההההה איזה תוכנית מעולההההההההה איזה
תוכנית מעולההההההההה איזה תוכנית מעולהההההההההאיזה תוכנית
מעולההההההההה`
  },
  {
    link: "../assets/pro.png",
    name: "Shalom 5",
    date: "18:33 23/1/2012",
    msg: `איזה תוכנית מעולהההההההההאיזה תוכנית מעולהההההההההאיזה תוכנית
מעולהההההההההאיזה תוכנית מעולההההההההה איזה תוכנית מעולההההההההה איזה
תוכנית מעולההההההההה איזה תוכנית מעולהההההההההאיזה תוכנית
מעולההההההההה`
  },
  {
    link: "../assets/pro.png",
    name: "Shalom 6",
    date: "18:33 23/1/2012",
    msg: `איזה תוכנית מעולהההההההההאיזה תוכנית מעולהההההההההאיזה תוכנית
מעולהההההההההאיזה תוכנית מעולההההההההה איזה תוכנית מעולההההההההה איזה
תוכנית מעולההההההההה איזה תוכנית מעולהההההההההאיזה תוכנית
מעולההההההההה`
  },
  {
    link: "../assets/pro.png",
    name: "Shalom 7",
    date: "18:33 23/1/2012",
    msg: `איזה תוכנית מעולהההההההההאיזה תוכנית מעולהההההההההאיזה תוכנית
מעולהההההההההאיזה תוכנית מעולההההההההה איזה תוכנית מעולההההההההה איזה
תוכנית מעולההההההההה איזה תוכנית מעולהההההההההאיזה תוכנית
מעולההההההההה`
  },
  {
    link: "../assets/pro.png",
    name: "Shalom 8",
    date: "18:33 23/1/2012",
    msg: `איזה תוכנית מעולהההההההההאיזה תוכנית מעולהההההההההאיזה תוכנית
מעולהההההההההאיזה תוכנית מעולההההההההה איזה תוכנית מעולההההההההה איזה
תוכנית מעולההההההההה איזה תוכנית מעולהההההההההאיזה תוכנית
מעולההההההההה`
  },
  {
    link: "../assets/pro.png",
    name: "Shalom 9",
    date: "18:33 23/1/2012",
    msg: `איזה תוכנית מעולהההההההההאיזה תוכנית מעולהההההההההאיזה תוכנית
מעולהההההההההאיזה תוכנית מעולההההההההה איזה תוכנית מעולההההההההה איזה
תוכנית מעולההההההההה איזה תוכנית מעולהההההההההאיזה תוכנית
מעולההההההההה`
  }
];

var livePosts = $(".post");

for (var i = 0; i < livePosts.length; i++) {
  let update = $(livePosts[i]);

  update.find("img").attr("src", posts[i].link);

  update.find("h2").text(posts[i].name);

  update.find("p").text(posts[i].date);

  update.find(".item3").text(posts[i].msg);
}

let index = 0;

setInterval(function() {
  for (var i = 0; i < livePosts.length; i++) {
    let update = $(livePosts[i]);

    update.find("img").attr("src", posts[i + index].link);

    update.find("h2").text(posts[i + index].name);

    update.find("p").text(posts[i + index].date);

    update.find(".item3").text(posts[i + index].msg);
  }
  index = (index + 1) % (posts.length - (livePosts.length - 1));
  // in order to animate:
  //I need to get the DOM Element using jquery and
  //loop using the id
  //something like:
  //let post1 = $("#first");  => make a .fadeIn(1000);
  //let post2 = $("#last");  => make a .fadeToggle(); and remove from the dom
  // right now im only changeing the attribute of the dom elements
  // I dont like my solution and tried to study animation during...
  //   $("#first").fadeIn(1000);
  //   $("#last").fadeToggle(500);
}, 2000);
